package city

type City struct {
	ID       int    `json:"id"`
	Name     string `json:"name"`
	Province string `json:"province"`
}

var Cities = []City{
	{1, "北京", "北京"}, {2, "上海", "上海"}, {3, "广州", "广东"}, {4, "深圳", "广东"},
	{5, "杭州", "浙江"}, {6, "南京", "江苏"}, {7, "成都", "四川"}, {8, "重庆", "重庆"},
	{9, "武汉", "湖北"}, {10, "西安", "陕西"}, {11, "天津", "天津"}, {12, "苏州", "江苏"},
	{13, "长沙", "湖南"}, {14, "郑州", "河南"}, {15, "青岛", "山东"}, {16, "大连", "辽宁"},
	{17, "宁波", "浙江"}, {18, "厦门", "福建"}, {19, "合肥", "安徽"}, {20, "福州", "福建"},
	{21, "昆明", "云南"}, {22, "济南", "山东"}, {23, "哈尔滨", "黑龙江"}, {24, "长春", "吉林"},
	{25, "沈阳", "辽宁"}, {26, "石家庄", "河北"}, {27, "南昌", "江西"}, {28, "贵阳", "贵州"},
	{29, "南宁", "广西"}, {30, "太原", "山西"}, {31, "兰州", "甘肃"}, {32, "呼和浩特", "内蒙古"},
	{33, "乌鲁木齐", "新疆"}, {34, "海口", "海南"}, {35, "银川", "宁夏"}, {36, "西宁", "青海"},
	{37, "拉萨", "西藏"},
}
